app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects"
---
  def new
    @project = Project.new
    @projects = Project.all

SELECT "projects".* FROM "projects"
INSERT INTO "projects" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"
---
  def create
    @projects = Project.all
    @project = Project.new(permitted_params)
    if @project.save

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "projects" SET "name" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["name", "New DB:WhoDis?"], ["updated_at", "2024-02-25 22:11:03.970232"], ["id", 2]]
---
  def update
    @projects = Project.all
    @project = Project.find(params[:id])
    if @project.update(permitted_params)